КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/BusinessProcesses/ОбслуживаниеПосетителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<BusinessProcess>
		<Properties>
			<Name>ОбслуживаниеПосетителя</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаБроньБилетов</xr:Item>
			</BasedOn>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кинозал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кинозалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказВБар</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказВБар</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/BusinessProcesses/ОбслуживаниеПосетителя/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаБроньБилетов") Тогда
		Клиент = ДанныеЗаполнения.Клиент;
		Кинозал = ДанныеЗаполнения.Кинозал;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ЗначениеЗаполнено(ВедущаяЗадача) Тогда
		Заказ = ВедущаяЗадача.Основание;
		Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказВБар") Тогда
			Если Не ЗначениеЗаполнено(Клиент) Тогда
				Клиент = Заказ.Клиент;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Кинозал) Тогда
				Кинозал = Заказ.Кинозал;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
